Merge branch 'slopcode' into windows
